MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM366FWFG/mcu.h
/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
typedef struct
{
  __IO uint32_t EN;                  /*!< TB Enable Register                      */
  __IO uint32_t RUN;                 /*!< TB RUN Register                         */
  __IO uint32_t CR;                  /*!< TB Control Register                     */
  __IO uint32_t MOD;                 /*!< TB Mode Register                        */
  __IO uint32_t FFCR;                /*!< TB Flip-Flop Control Register           */
  __I  uint32_t ST;                  /*!< TB Status Register                      */
  __IO uint32_t IM;                  /*!< TB Interrupt Mask Register              */
  __I  uint32_t UC;                  /*!< TB Read Capture Register                */
  __IO uint32_t RG0;                 /*!< TB RG0 Timer Register                   */
  __IO uint32_t RG1;                 /*!< TB RG1 Timer Register                   */
  __I  uint32_t CP0;                 /*!< TB CP0 Capture Register                 */
  __I  uint32_t CP1;                 /*!< TB CP1 Capture Register                 */
  __IO uint32_t DMA;                 /*!< TB DMA Enable Register                  */
} TSB_TB_TypeDef;

/**
  * @brief Serial Bus Interface (SBI)
  */
typedef struct
{
  __IO uint32_t CR0;                 /*!< SBI Control Register 0                  */
  __IO uint32_t CR1;                 /*!< SBI Control Register 1                  */
  __IO uint32_t DBR;                 /*!< SBI Data Buffer Register                */
  __IO uint32_t I2CAR;               /*!< SBI I2C Bus Address Register            */
union {
  __O  uint32_t CR2;                 /*!< SBI Control Register 2                  */
  __I  uint32_t SR;                  /*!< SBI Status Register                     */
  };
  __IO uint32_t BR0;                 /*!< SBI Baud Rate Register 0                */
} TSB_SBI_TypeDef;

/**
  * @brief Serial Channel (SC)
  */
typedef struct
{
  __IO uint32_t EN;                  /*!< SC Enable Register                       */
  __IO uint32_t BUF;                 /*!< SC Buffer Register                       */
  __IO uint32_t CR;                  /*!< SC Control Register                      */
  __IO uint32_t MOD0;                /*!< SC Mode Control Register 0               */
  __IO uint32_t BRCR;                /*!< SC Baud Rate Generator Control Register  */
  __IO uint32_t BRADD;               /*!< SC Baud Rate Generator Control Register 2*/
  __IO uint32_t MOD1;                /*!< SC Mode Control Register 1               */
  __IO uint32_t MOD2;                /*!< SC Mode Control Register 2               */
  __IO uint32_t RFC;                 /*!< SC RX FIFO Configuration Register        */
  __IO uint32_t TFC;                 /*!< SC TX FIFO Configuration Register        */
  __I  uint32_t RST;                 /*!< SC RX FIFO Status Register               */
  __I  uint32_t TST;                 /*!< SC TX FIFO Status Register               */
  __IO uint32_t FCNF;                /*!< SC FIFO Configuration Register           */
  __IO uint32_t DMA;                 /*!< SC DMA Enable Register                   */
} TSB_SC_TypeDef;

/**
  * @brief Watchdog Timer (WD)
  */
typedef struct
{
  __IO uint32_t MOD;                 /*!< WD Mode Register                        */
  __O  uint32_t CR;                  /*!< WD Control Register                     */
} TSB_WD_TypeDef;

/**
  * @brief Clock Generator (CG)
  */
typedef struct
{
  __IO uint32_t SYSCR;               /*!< System Control Register                 */
  __IO uint32_t OSCCR;               /*!< Oscillation Control Register            */
  __IO uint32_t STBYCR;              /*!< Standby Control Register                */
  __IO uint32_t PLLSEL;              /*!< PLL Selection Register                  */
  __IO uint32_t CKSEL;               /*!< System Clock Selection Register         */
       uint32_t RESERVED0[9];
  __IO uint32_t USBCTL;              /*!< USB Clock& Reset Control register       */
  __IO uint32_t PROTECT;             /*!< Protect Register                        */
  __IO uint32_t IMCGA;               /*!< CG Interrupt Mode Control Register A    */
  __IO uint32_t IMCGB;               /*!< CG Interrupt Mode Control Register B    */
  __IO uint32_t IMCGC;               /*!< CG Interrupt Mode Control Register C    */
       uint32_t RESERVED1[5];
  __O  uint32_t ICRCG;               /*!< CG Interrupt Request Clear Register     */
  __IO uint32_t RSTFLG;              /*!< Reset Flag Register                     */
  __I  uint32_t NMIFLG;              /*!< NMI Flag Register                       */
} TSB_CG_TypeDef;

/**
  * @brief Flash Control (FC)
  */
typedef struct
{
  __IO uint32_t SECBIT;              /*!< FC Security Bit Register                */
       uint32_t RESERVED0[3];
  __I  uint32_t FLCS;                /*!< FC Flash Control Register               */
} TSB_FC_TypeDef;


/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


#define TSB_DMACA_BASE             (PERI_BASE  + 0x0000000UL)
#define TSB_DMACB_BASE             (PERI_BASE  + 0x0001000UL)
#define TSB_UDFS_BASE              (PERI_BASE  + 0x0008000UL)
#define TSB_UDFS2_BASE             (PERI_BASE  + 0x0008200UL)
#define TSB_SSP0_BASE              (PERI_BASE  + 0x0040000UL)
#define TSB_SSP1_BASE              (PERI_BASE  + 0x0041000UL)
#define TSB_SSP2_BASE              (PERI_BASE  + 0x0042000UL)
#define TSB_UART_BASE              (PERI_BASE  + 0x0048000UL)
#define TSB_AD_BASE                (PERI_BASE  + 0x0050000UL)
#define TSB_EXB_BASE               (PERI_BASE  + 0x005C000UL)
#define TSB_PA_BASE                (PERI_BASE  + 0x00C0000UL)
#define TSB_PB_BASE                (PERI_BASE  + 0x00C0100UL)
#define TSB_PC_BASE                (PERI_BASE  + 0x00C0200UL)
#define TSB_PD_BASE                (PERI_BASE  + 0x00C0300UL)
#define TSB_PE_BASE                (PERI_BASE  + 0x00C0400UL)
#define TSB_PF_BASE                (PERI_BASE  + 0x00C0500UL)
#define TSB_PG_BASE                (PERI_BASE  + 0x00C0600UL)
#define TSB_PH_BASE                (PERI_BASE  + 0x00C0700UL)
#define TSB_PI_BASE                (PERI_BASE  + 0x00C0800UL)
#define TSB_PJ_BASE                (PERI_BASE  + 0x00C0900UL)
#define TSB_PK_BASE                (PERI_BASE  + 0x00C0A00UL)
#define TSB_TB0_BASE               (PERI_BASE  + 0x00C4000UL)
#define TSB_TB1_BASE               (PERI_BASE  + 0x00C4100UL)
#define TSB_TB2_BASE               (PERI_BASE  + 0x00C4200UL)
#define TSB_TB3_BASE               (PERI_BASE  + 0x00C4300UL)
#define TSB_TB4_BASE               (PERI_BASE  + 0x00C4400UL)
#define TSB_TB5_BASE               (PERI_BASE  + 0x00C4500UL)
#define TSB_TB6_BASE               (PERI_BASE  + 0x00C4600UL)
#define TSB_TB7_BASE               (PERI_BASE  + 0x00C4700UL)
#define TSB_TB8_BASE               (PERI_BASE  + 0x00C4800UL)
#define TSB_TB9_BASE               (PERI_BASE  + 0x00C4900UL)
#define TSB_SBI0_BASE              (PERI_BASE  + 0x00E0000UL)
#define TSB_SBI1_BASE              (PERI_BASE  + 0x00E0100UL)
#define TSB_SC0_BASE               (PERI_BASE  + 0x00E1000UL)
#define TSB_SC1_BASE               (PERI_BASE  + 0x00E1100UL)
#define TSB_WD_BASE                (PERI_BASE  + 0x00F2000UL)
#define TSB_CG_BASE                (PERI_BASE  + 0x00F3000UL)
#define TSB_FC_BASE                (PERI_BASE  + 0x1FFF010UL)


